"""
Есть список состоящий из целых чисел. Создать три списка:

- в первый список добавить числа, которые делятся только на 3, но не на 5

- во второй список добавить числа, которые делятся только на 5, но не на 3

- в третий список добавить числа, которые делятся и на 3, и на 5



[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]  # Input list
[3, 6, 9, 12]  # elements divided by 3
[5, 10]  # elements divided by 5
[0, 15]  # elements divided by 3 and by 5
"""
data = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
res1 = []
res2 = []
res3 = []
for i in data:
    if i % 3 == 0 and i % 5 != 0:
        res1.append(i)
    elif i % 5 == 0 and i % 3 != 0:
        res2.append(i)
    elif i % 3 == 0 and i % 5 == 0:
        res3.append(i)
print(res1)
print(res2)
print(res3)
